import com.company.Cell.Cell

class Field() {
    var field:ArrayList<Cell> = arrayListOf(
            Basic(0,1,"ПРОХОД КРУГА"),
            Shop(1,"Комсомольская площадь".toUpperCase(),600.0,20.0,500.0),
            Treasury(2,"КАЗНА"),
            Shop(3,"КРЫМСКИЙ МОСТ",600.0,40.0,500.0),
            Penalty(4,2000.0,"ПОДОХОДНЫЙ НАЛОГ"),
            Railway(5,2000.0,250.0,"РИЖСКА Ж/Д",false),
            Shop(6,"ПРОСПЕКТ МИРА", 1000.0,60.0,500.0),
            Treasury(7,"ШАНС"),
            Shop(8,"ЛЕНИНГРАДСКИЙ ПР-Т", 1000.0,60.0,500.0),
            Shop(9,"ЛУЖНЕЦКАЯ НАБЕРЕЖНАЯ", 1200.0,80.0,500.0),
            Basic(10,2,"ТЮРЬМА"),
            Shop(11,"ЦДМ НА ЛУБЯНКЕ", 1400.0,100.0,1000.0),
            Railway(12,1500.0,10.0,"ЭЛЕКТРИЧЕСТВО",true),
            Shop(13,"ТВОЙ ДОМ", 1400.0,100.0,1000.0),
            Shop(14,"КРАСНОПРЕСНЕНСКАЯ НАБ", 1600.0,120.0,1000.0),
            Railway(15,2000.0,250.0,"КУРСКАЯ Ж/Д",false),
            Shop(16,"КОТЕЛЬНИЧЕСКАЯ НАБ", 1800.0,140.0,1000.0),
            Treasury(17,"КАЗНА"),
            Shop(18,"КРАСНОПРЕСНЕНСКАЯ НАБ", 1800.0,140.0,1000.0),
            Shop(19,"РУБЛЕВСКОЕ ШОССЕ", 2000.0,160.0,1000.0),
            Basic(20,3,"СТОЯНКА"),
            Shop(21,"ТВЕРСКАЯ УЛИЦА", 2200.0,180.0,1500.0),
            Treasury(22,"ШАНС"),
            Shop(23,"МАЯКОВСКАЯ ПЛ", 2200.0,180.0,1500.0),
            Shop(24,"ПУШКИНСКАЯ ПЛ", 2400.0,200.0,1500.0),
            Railway(25,2000.0,250.0,"КАЗАНСКАЯ Ж/Д",false),
            Shop(26,"КУТУЗОВСКИЙ ПР-Т", 2600.0,220.0,1500.0),
            Shop(27,"ВАСИЛЬЕВСКИЙ СПУСК", 2600.0,220.0,1500.0),
            Railway(28,1500.0,10.0,"ВОДОПРОВОД",true),
            Shop(29,"КРЕМЛЕВСКАЯ НАБ", 2800.0,240.0,1500.0),
            Basic(30,4,"В ТЮРЬМУ"),
            Shop(31,"НОВЫЙ АРБАТ", 3000.0,260.0,2000.0),
            Shop(32,"ОХОТНЫЙ РЯД", 3000.0,260.0,2000.0),
            Treasury(33,"КАЗНА"),
            Shop(34,"ТЕАТРАЛЬНАЯ ПЛОЩАДЬ", 3200.0,280.0,2000.0),
            Railway(35,2000.0,250.0,"ЛЕНИНГРАДСКАЯ Ж/Д",false),
            Treasury(36,"ШАНС"),
            Shop(37,"АРБАТ", 3500.0,350.0,2000.0),
            Penalty(38,2000.0,"НАЛОГ НА БОГАТСТВО"),
            Shop(39,"МАНЕЖНАЯ ПЛ", 4000.0,500.0,2000.0),
        )
    var size=field.size
        fun printField(){

        }

}